dvs-jc/app/controllers/students_controller.rb

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("created_at", "date_of_birth", "first_name", "jc_days_sentenced", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "students" SET "jc_days_sentenced" = 2, "updated_at" = '2012-04-11 23:09:18.858123' WHERE "students"."id" = 1